// 6. Написать программу вычисления значения функции y = sin(a). (Класс Math)
System.Console.Write("Введите число a: ");
int a = Convert.ToInt32(Console.ReadLine());
System.Console.WriteLine(Math.Sin(a));